bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_e907_std/BSP_Common/dvp/src/img_proc.c
/*
 * Copyright (c) 2016-2023 Bouffalolab.
 *
 * This file is part of
 *     *** Bouffalolab Software Dev Kit ***
 *      (see www.bouffalolab.com).
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include <string.h>
#include <bl808_isp_misc.h>
#include <bl808_isp_wdr.h>

#include "img_param.h"
#include "img_proc.h"
#include "wdr_firmware.h"
#include "bnr_firmware.h"


#define PERFORMANCE_MONITOR     0
#define IMG_PROC_SKIP_NUM       0
#define DEFAULT_AWB_ALGO        AWB_ALGO_2
#define ENABLE_3DNR             1
#define WB_BIAS_CT_THRESH       COLOR_TEMP_D50

#define GPIO_IR_BOARD_IRC       (0xFF)
#define GPIO_SENSOR_BOARD_IRC   (0xFF)

#define IMG_UPDATE_MASK_LSC         (1 << 0)
#define IMG_UPDATE_MASK_DPC         (1 << 1)
#define IMG_UPDATE_MASK_WB_GAIN     (1 << 2)
#define IMG_UPDATE_MASK_CCM         (1 << 3)
#define IMG_UPDATE_MASK_GAMMA       (1 << 4)
#define IMG_UPDATE_MASK_WDR         (1 << 5)
#define IMG_UPDATE_MASK_SATURATION  (1 << 6)
#define IMG_UPDATE_MASK_NOISE_LEVEL (1 << 7)
#define IMG_UPDATE_MASK_EE          (1 << 8)
#define IMG_UPDATE_MASK_CS          (1 << 9)
#define IMG_UPDATE_MASK_BLC         (1 << 10)
#define IMG_UPDATE_MASK_BNR         (1 << 11)


typedef struct {
    int stop_imgproc_flag;
    uint16_t skip_num;
    uint16_t start_skip_num;
    uint16_t update_force;
    AWB_ALGO awb_algo;
    const BL_IMG_PARAM_DESC_T *img_param;
} imgproc_obj_t;

typedef struct
{
    uint32_t update_mask;
    ISP_CLAMP_S clamp;
    ISP_LSC_COEF_S lsc;
    ISP_LSC_MAX_S lsc_max;
    ISP_DPC_THRESHOLD_GROUP_TYPE dpc;
    ISP_RB_Gain_Type rb_gain;
    ISP_CCM_COEF_S ccm;
    ISP_Gamma_Curve_Type gamma;
    int saturation;
    int noise_lv;
    ISP_EE_Str_Type ee_str;
    ISP_EE_Thresh_Type ee_th;
    ISP_Chroma_Suppress_Type cs;
} img_porc_isp_cfg_t;

// TODO: use heap
static imgproc_obj_t img_proc;
static img_porc_isp_cfg_t isp_cfg;
static BL_ISP_DAY_NIGHT_MODE_T day_night_mode = BL_DAY_MODE;

static int img_procawb_algo_new = DEFAULT_AWB_ALGO;

extern BL_EXPO_TIME sensor_expo_time;
extern BL_GAIN_DB sensor_gain;

#if PERFORMANCE_MONITOR
#define FRM_CNT_FOR_ONE_STATS     100       /* 8 sec */
static int ae_handl_cnt = 0;
static TickType_t ae_handl_start_time = 0;
#endif

void ir_cut_switch(bool enable)
{
}

static BL_Fun_Type imgproc_is_module_enable(img_param_module_t module)
{
    return (img_proc.img_param->state_tbl->state)[module];
}

static uint32_t imgproc_is_module_update(uint32_t mask)
{
    return mask & isp_cfg.update_mask;
}

static void imgproc_set_module_update(uint32_t mask)
{
    isp_cfg.update_mask |= mask;
}

static void imgproc_clear_module_update()
{
    isp_cfg.update_mask = 0;
}

static void imgproc_set_reg()
{
	ISP_SATURATION_S satCfg;
	
    if (imgproc_is_module_update(IMG_UPDATE_MASK_BLC)) {
        ISP_Set_BLC(&(isp_cfg.clamp));
    }

    if (imgproc_is_module_update(IMG_UPDATE_MASK_DPC)) {
        ISP_Set_Defect_Correction_Threshold_Group(&(isp_cfg.dpc));
    }

    if (imgproc_is_module_update(IMG_UPDATE_MASK_DPC)) {
        ISP_Set_Defect_Correction_Threshold_Group(&(isp_cfg.dpc));
    }

    if (imgproc_is_module_update(IMG_UPDATE_MASK_BNR)) {
        bnr_hw_update();
    }

    if (imgproc_is_module_update(IMG_UPDATE_MASK_WB_GAIN)) {
        ISP_Set_RB_Gain(&(isp_cfg.rb_gain));
    }

    if (imgproc_is_module_update(IMG_UPDATE_MASK_GAMMA)) {
        ISP_Set_Gamma_Coef(&(isp_cfg.gamma));
    }

    if (imgproc_is_module_update(IMG_UPDATE_MASK_CCM)) {
        ISP_Set_CCM_Coef(&(isp_cfg.ccm));
    }

    if (imgproc_is_module_update(IMG_UPDATE_MASK_WDR)) {
        wdr_hw_update();
    }

    if (imgproc_is_module_update(IMG_UPDATE_MASK_SATURATION)) {
		if (BL_DAY_MODE == day_night_mode) {
			satCfg.saturation_cb = isp_cfg.saturation;
			satCfg.saturation_cr = isp_cfg.saturation;
			ISP_Set_Saturation(&satCfg);
		} else {
			satCfg.saturation_cb = 0;
			satCfg.saturation_cr = 0;
			ISP_Set_Saturation(&satCfg);
		}
    }

    if (imgproc_is_module_update(IMG_UPDATE_MASK_NOISE_LEVEL)) {
        ISP_Set_Noise_Level(isp_cfg.noise_lv);
    }

    if (imgproc_is_module_update(IMG_UPDATE_MASK_EE)) {
        ISP_Set_EE_Strength(&(isp_cfg.ee_str));
        ISP_Set_EE_Thresh(&(isp_cfg.ee_th));
    }

    if (imgproc_is_module_update(IMG_UPDATE_MASK_CS)) {
        ISP_Set_ChromaSuppress(&(isp_cfg.cs));
    }

    imgproc_clear_module_update();
}

static int imgproc_check_param_table()
{
    int ret = 1;

    ret *= (ISP_TBL_AUTO_ISO \
        == (img_proc.img_param->ae_target_tbl->header.table));
    ret *= (ISP_TBL_CUSTOM_COLOR_TMPER \
        == (img_proc.img_param->awb_white_region_tbl->header.table));
    ret *= (ISP_TBL_CUSTOM_COLOR_TMPER \
        == (img_proc.img_param->wb_bias_tbl->header.table));
    ret *= (ISP_TBL_CUSTOM_COLOR_TMPER \
        == (img_proc.img_param->wb_info_tbl->header.table));
    ret *= (ISP_TBL_INIT \
        == (img_proc.img_param->blc_tbl->header.table));
    ret *= (ISP_TBL_AUTO_ISO \
        == (img_proc.img_param->defect_corr_tbl->header.table));
    ret *= (ISP_TBL_AUTO_ISO \
        == (img_proc.img_param->bnr_fw_config_tbl->header.table));
    ret *= (ISP_TBL_CUSTOM_COLOR_TMPER \
        == (img_proc.img_param->lens_shading_corr_tbl->header.table));
    ret *= (ISP_TBL_CUSTOM_COLOR_TMPER \
        == (img_proc.img_param->color_corr_tbl->header.table));
    ret *= (ISP_TBL_CUSTOM_EV \
        == (img_proc.img_param->gamma_corr_tbl->header.table));
    ret *= (ISP_TBL_CUSTOM_EV \
        == (img_proc.img_param->wdr_fw_config_tbl->header.table));
    ret *= (ISP_TBL_AUTO_ISO \
        == (img_proc.img_param->saturation_tbl->header.table));
    ret *= (ISP_TBL_AUTO_ISO \
        == (img_proc.img_param->noise_reduction_tbl->header.table));
    ret *= (ISP_TBL_AUTO_ISO \
        == (img_proc.img_param->edge_enhance_tbl->header.table));
    ret *= (ISP_TBL_AUTO_ISO \
        == (img_proc.img_param->cs_tbl->header.table));

