bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_e907_std/BSP_Common/dvp/src/img_proc.c
    return (ret == 1) ? 0 : -1;
}

static int imgproc_check_param_policy()
{
    int ret = 1;

    ret *= (ISP_POL_INTERPL \
        == (img_proc.img_param->ae_target_tbl->header.policy));
    ret *= (ISP_POL_INTERPL \
        == (img_proc.img_param->awb_white_region_tbl->header.policy));
    ret *= (ISP_POL_INTERPL \
        == (img_proc.img_param->wb_bias_tbl->header.policy));
    ret *= (ISP_POL_INTERPL \
        == (img_proc.img_param->wb_info_tbl->header.policy));
    ret *= (ISP_POL_INIT \
        == (img_proc.img_param->blc_tbl->header.policy));
    ret *= (ISP_POL_INTERPL \
        == (img_proc.img_param->defect_corr_tbl->header.policy));
    ret *= (ISP_POL_INIT \
        == (img_proc.img_param->bnr_fw_config_tbl->header.policy));
    ret *= (ISP_POL_INTERPL \
        == (img_proc.img_param->lens_shading_corr_tbl->header.policy));
    ret *= (ISP_POL_INTERPL \
        == (img_proc.img_param->color_corr_tbl->header.policy));
    ret *= (ISP_POL_INTERPL \
        == (img_proc.img_param->gamma_corr_tbl->header.policy));
    ret *= (ISP_POL_INTERPL \
        == (img_proc.img_param->wdr_fw_config_tbl->header.policy));
    ret *= (ISP_POL_INTERPL \
        == (img_proc.img_param->saturation_tbl->header.policy));
    ret *= (ISP_POL_INTERPL \
        == (img_proc.img_param->noise_reduction_tbl->header.policy));
    ret *= (ISP_POL_INTERPL \
        == (img_proc.img_param->edge_enhance_tbl->header.policy));
    ret *= (ISP_POL_INTERPL \
        == (img_proc.img_param->cs_tbl->header.policy));

    return (ret == 1) ? 0 : -1;
}

static void linear_intpl_by_gain(int value_L, int value_H, BL_GAIN_DB gain, int *value_out)
{
    BL_GAIN_DB gain_L = (gain / GAIN_6_DB) * GAIN_6_DB;
    BL_GAIN_DB gain_H = gain_L + GAIN_6_DB;

    intpl_point_t point_L = create_intpl_point(gain_L, value_L);
    intpl_point_t point_H = create_intpl_point(gain_H, value_H);
    linear_interpolate(&point_L, &point_H, gain, value_out);
}

static int img_update_ae()
{
    if (!imgproc_is_module_enable(ISP_ADJ_AE)) {
        return -1;
    }

    ae_control();
    return 0;
}

static int img_update_ae_target(BL_GAIN_DB gain, int *ae_target)
{
    if (!imgproc_is_module_enable(ISP_ADJ_AE)) {
        return -1;
    }

    int param_idx;
    BL_GAIN_DB gain_L, gain_H;
    int ae_target_L, ae_target_H, ae_target_new;
    intpl_point_t point_L;
    intpl_point_t point_H;

    param_idx = gain / GAIN_6_DB;

    img_param_get_ae_target(param_idx, &ae_target_L);
    img_param_get_ae_target(param_idx + 1, &ae_target_H);

    gain_L = INT_TO_GAIN_DB(param_idx * 6);
    gain_H = INT_TO_GAIN_DB((param_idx + 1) * 6);

    point_L = create_intpl_point(gain_L, ae_target_L);
    point_H = create_intpl_point(gain_H, ae_target_H);
    linear_interpolate(&point_L, &point_H, gain, &ae_target_new);

    *ae_target = ae_target_new;

//    MSG("ae_target: (%d ~ %d) -> %d\r\n", ae_target_L, ae_target_H, ae_target_new);

    return 0;
}

static int img_update_awb()
{
    if (!imgproc_is_module_enable(ISP_ADJ_AWB)) {
        return -1;
    }

    awb_control();
    return 0;
}

static int img_update_wb_gain(ISP_RB_Gain_Type *rb_gain, BL_COLOR_TEMP color_temp, ISP_RB_Gain_Type *rb_bias)
{
    if (!imgproc_is_module_enable(ISP_ADJ_AWB)) {
        return -1;
    }

    imgproc_set_module_update(IMG_UPDATE_MASK_WB_GAIN);

    /* apply wb gain bias according to color temp thresh */
    if (color_temp <= WB_BIAS_CT_THRESH) {
        isp_cfg.rb_gain = *rb_gain;
    } else {
        isp_cfg.rb_gain.r_gain = DIV_ROUND(rb_gain->r_gain * rb_bias->r_gain, RGB_GAIN_1X);
        isp_cfg.rb_gain.b_gain = DIV_ROUND(rb_gain->b_gain * rb_bias->b_gain, RGB_GAIN_1X);
    }

    MSG("final wb gain: (%d, %d) -> (%d, %d)\r\n", rb_gain->r_gain, rb_gain->b_gain,
        isp_cfg.rb_gain.r_gain, isp_cfg.rb_gain.b_gain);

    return 0;
}

static int img_update_wb_bias(BL_GAIN_DB sys_gain, ISP_RB_Gain_Type *rb_bias)
{
    if (!imgproc_is_module_enable(ISP_ADJ_AWB)) {
        return -1;
    }

    int wb_bias_idx;
    BL_GAIN_DB sys_gain_L, sys_gain_H;
    const wb_bais_t *wb_bias_L, *wb_bias_H;
    intpl_point_t point_L, point_H;
    int gain_tmp;
    int num_wb_bias = img_param_get_num_wb_bias();

    for (wb_bias_idx = 0; wb_bias_idx < (num_wb_bias - 1); wb_bias_idx++) {

        img_param_get_wb_bias(wb_bias_idx, &wb_bias_L);
        img_param_get_wb_bias(wb_bias_idx + 1, &wb_bias_H);

        sys_gain_L = INT_TO_GAIN_DB(wb_bias_L->sys_gain_db);
        sys_gain_H = INT_TO_GAIN_DB(wb_bias_H->sys_gain_db);

        if (sys_gain >= sys_gain_L && sys_gain <= sys_gain_H) {
            /* now we get the range of sys gain */

            /* interpolate r_gain */
            point_L = create_intpl_point(sys_gain_L, wb_bias_L->rb_gain.r_gain);
            point_H = create_intpl_point(sys_gain_H, wb_bias_H->rb_gain.r_gain);
            linear_interpolate(&point_L, &point_H, sys_gain, &gain_tmp);
            rb_bias->r_gain = gain_tmp;

            /* interpolate b_gain */
            point_L = create_intpl_point(sys_gain_L, wb_bias_L->rb_gain.b_gain);
            point_H = create_intpl_point(sys_gain_H, wb_bias_H->rb_gain.b_gain);
            linear_interpolate(&point_L, &point_H, sys_gain, &gain_tmp);
            rb_bias->b_gain = gain_tmp;
            return 0;
        }

        if (wb_bias_idx == 0 && sys_gain < sys_gain_L) {
            *rb_bias = wb_bias_L->rb_gain;
            return 0;
        }

        if (wb_bias_idx == (num_wb_bias - 2) && sys_gain > sys_gain_H) {
            *rb_bias = wb_bias_H->rb_gain;
            return 0;
        }
    }

    /* should never reach here */
    return -1;
}

static int img_update_blc()
{
    if (!imgproc_is_module_enable(ISP_ADJ_BLC)) {
        return -1;
    }

    imgproc_set_module_update(IMG_UPDATE_MASK_BLC);
    const black_lvl_corr_t *black_lvl_corr;

    img_param_get_default_blc(&black_lvl_corr);
    isp_cfg.clamp.clamp_r  = black_lvl_corr->black_level;
    isp_cfg.clamp.clamp_gr = black_lvl_corr->black_level;
    isp_cfg.clamp.clamp_gb = black_lvl_corr->black_level;
    isp_cfg.clamp.clamp_b  = black_lvl_corr->black_level;

