bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_e907_std/BSP_Common/dvp/src/img_proc.c
    return 0;
}

static int img_update_dpc(BL_GAIN_DB gain)
{
    if (!imgproc_is_module_enable(ISP_ADJ_DPC)) {
        return -1;
    }

    int param_idx;
    const defect_corr_t *defect_corr_L, *defect_corr_H;
    int defect_THR_1, defect_THR_2;

    param_idx = gain / GAIN_6_DB;
    imgproc_set_module_update(IMG_UPDATE_MASK_DPC);
//    MSG("gain %.4f dB, param_idx %d\r\n", GAIN_DB_INT_TO_FLOAT(gain), param_idx);

    img_param_get_defect_corr(param_idx, &defect_corr_L);
    img_param_get_defect_corr(param_idx + 1, &defect_corr_H);

    linear_intpl_by_gain(defect_corr_L->defect_THR_1, defect_corr_H->defect_THR_1, gain, &defect_THR_1);
    linear_intpl_by_gain(defect_corr_L->defect_THR_2, defect_corr_H->defect_THR_2, gain, &defect_THR_2);

    isp_cfg.dpc.data[0] = defect_THR_1;
    isp_cfg.dpc.data[1] = defect_THR_2;
    isp_cfg.dpc.data[2] = 50;
    isp_cfg.dpc.data[3] = 50;
    isp_cfg.dpc.data[4] = 20;


//    MSG("Defect corr: defect_THR_1 (%d ~ %d) -> %d, defect_THR_2 (%d ~ %d) -> %d\r\n",
//        defect_corr_L->defect_THR_1, defect_corr_H->defect_THR_1, defect_THR_1,
//        defect_corr_L->defect_THR_2, defect_corr_H->defect_THR_2, defect_THR_2);

    return 0;
}

static int img_update_bnr(BL_GAIN_DB gain)
{
    if (!imgproc_is_module_enable(ISP_ADJ_BNR)) {
        return -1;
    }

    imgproc_set_module_update(IMG_UPDATE_MASK_BNR);
    bnr_control(gain);

    return 0;
}

static int img_update_lsc(BL_COLOR_TEMP color_temp)
{
    if (!imgproc_is_module_enable(ISP_ADJ_LSC)) {
        return -1;
    }

    int lsc_idx, i;
    int lsc_num = img_param_get_num_lsc();
    BL_COLOR_TEMP color_temp_L, color_temp_H;
    const lens_shade_corr_t *lsc_corr_L, *lsc_corr_H;
    intpl_point_t point_L, point_H;

    imgproc_set_module_update(IMG_UPDATE_MASK_LSC);

    for (lsc_idx = 0; lsc_idx < (lsc_num - 1); lsc_idx++) {

        img_param_get_lsc(lsc_idx, &lsc_corr_L);
        img_param_get_lsc(lsc_idx + 1, &lsc_corr_H);

        color_temp_L = lsc_corr_L->color_temp;
        color_temp_H = lsc_corr_H->color_temp;

        if (color_temp >= color_temp_L && color_temp <= color_temp_H) {
            /* now we get the range of color temp */

            for (i = 0; i < LSC_COEF_NUM; i++) {
                /* interpolate each coef of LSC R */
                point_L = create_intpl_point(color_temp_L, lsc_corr_L->lsc_coef_r.coef[i]);
                point_H = create_intpl_point(color_temp_H, lsc_corr_H->lsc_coef_r.coef[i]);
                linear_interpolate(&point_L, &point_H, color_temp, &(isp_cfg.lsc.lsc_coef_r.coef[i]));
            }
            for (i = 0; i < LSC_COEF_NUM; i++) {
                /* interpolate each coef of LSC G */
                point_L = create_intpl_point(color_temp_L, lsc_corr_L->lsc_coef_g.coef[i]);
                point_H = create_intpl_point(color_temp_H, lsc_corr_H->lsc_coef_g.coef[i]);
                linear_interpolate(&point_L, &point_H, color_temp, &(isp_cfg.lsc.lsc_coef_g.coef[i]));
            }
            for (i = 0; i < LSC_COEF_NUM; i++) {
                /* interpolate each coef of LSC B */
                point_L = create_intpl_point(color_temp_L, lsc_corr_L->lsc_coef_b.coef[i]);
                point_H = create_intpl_point(color_temp_H, lsc_corr_H->lsc_coef_b.coef[i]);
                linear_interpolate(&point_L, &point_H, color_temp, &(isp_cfg.lsc.lsc_coef_b.coef[i]));
            }

            point_L = create_intpl_point(color_temp_L, lsc_corr_L->lsc_max.max_r);
            point_H = create_intpl_point(color_temp_H, lsc_corr_H->lsc_max.max_r);
            linear_interpolate(&point_L, &point_H, color_temp, &(isp_cfg.lsc_max.max_r));
            point_L = create_intpl_point(color_temp_L, lsc_corr_L->lsc_max.max_g);
            point_H = create_intpl_point(color_temp_H, lsc_corr_H->lsc_max.max_g);
            linear_interpolate(&point_L, &point_H, color_temp, &(isp_cfg.lsc_max.max_g));
            point_L = create_intpl_point(color_temp_L, lsc_corr_L->lsc_max.max_b);
            point_H = create_intpl_point(color_temp_H, lsc_corr_H->lsc_max.max_b);
            linear_interpolate(&point_L, &point_H, color_temp, &(isp_cfg.lsc_max.max_b));

            break;
        }
        else if (lsc_idx == 0 && color_temp < color_temp_L) {
            for (i = 0; i < LSC_COEF_NUM; i++) {
                isp_cfg.lsc.lsc_coef_r.coef[i] = lsc_corr_L->lsc_coef_r.coef[i];
                isp_cfg.lsc.lsc_coef_g.coef[i] = lsc_corr_L->lsc_coef_g.coef[i];
                isp_cfg.lsc.lsc_coef_b.coef[i] = lsc_corr_L->lsc_coef_b.coef[i];
            }
            isp_cfg.lsc_max.max_r = lsc_corr_L->lsc_max.max_r;
            isp_cfg.lsc_max.max_g = lsc_corr_L->lsc_max.max_g;
            isp_cfg.lsc_max.max_b = lsc_corr_L->lsc_max.max_b;
            break;
        }
        else if (lsc_idx == (lsc_num - 2) && color_temp > color_temp_H) {
            for (i = 0; i < LSC_COEF_NUM; i++) {
                isp_cfg.lsc.lsc_coef_r.coef[i] = lsc_corr_H->lsc_coef_r.coef[i];
                isp_cfg.lsc.lsc_coef_g.coef[i] = lsc_corr_H->lsc_coef_g.coef[i];
                isp_cfg.lsc.lsc_coef_b.coef[i] = lsc_corr_H->lsc_coef_b.coef[i];
            }
            isp_cfg.lsc_max.max_r = lsc_corr_H->lsc_max.max_r;
            isp_cfg.lsc_max.max_g = lsc_corr_H->lsc_max.max_g;
            isp_cfg.lsc_max.max_b = lsc_corr_H->lsc_max.max_b;
            break;
        }
    }

//    MSG("img_update_lsc: %d, %d, %d\r\n", isp_cfg.lsc.lsc_coef_r.coef[0], isp_cfg.lsc.lsc_coef_r.coef[1],
//        isp_cfg.lsc.lsc_coef_r.coef[2]);

    return 0;
}

static int calc_ccm_by_color_temp(BL_COLOR_TEMP color_temp, ISP_CCM_COEF_S *ccm)
{
    int ccm_idx, i;
    int ccm_num = img_param_get_num_color_corr();
    BL_COLOR_TEMP color_temp_L, color_temp_H;
    const color_corr_t *color_corr_L, *color_corr_H;
    intpl_point_t point_L, point_H;

    for (ccm_idx = 0; ccm_idx < (ccm_num - 1); ccm_idx++) {

        img_param_get_color_corr(ccm_idx, &color_corr_L);
        img_param_get_color_corr(ccm_idx + 1, &color_corr_H);

