bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_e907_std/BSP_Common/dvp/src/img_proc.c
        color_temp_L = color_corr_L->color_temp;
        color_temp_H = color_corr_H->color_temp;

        if (color_temp >= color_temp_L && color_temp <= color_temp_H) {
            /* now we get the range of color temp */

            for (i = 0; i < CCM_COEF_NUM; i++) {
                /* interpolate each coef of CCM */
                point_L = create_intpl_point(color_temp_L, color_corr_L->ccm.ccm_coef[i]);
                point_H = create_intpl_point(color_temp_H, color_corr_H->ccm.ccm_coef[i]);
                linear_interpolate(&point_L, &point_H, color_temp, &ccm->ccm_coef[i]);
            }
            return 0;
        }
        else if (ccm_idx == 0 && color_temp < color_temp_L) {
            for (i = 0; i < CCM_COEF_NUM; i++) {
                ccm->ccm_coef[i] = color_corr_L->ccm.ccm_coef[i];
            }
            return 0;
        }
        else if (ccm_idx == (ccm_num - 2) && color_temp > color_temp_H) {
            for (i = 0; i < CCM_COEF_NUM; i++) {
                ccm->ccm_coef[i] = color_corr_H->ccm.ccm_coef[i];
            }
            return 0;
        }
    }

    /* shouldn't reach here */
    return -1;
}

static int img_update_ccm(BL_COLOR_TEMP color_temp)
{
    ISP_CCM_COEF_S ccm;
    if (!imgproc_is_module_enable(ISP_ADJ_CCM)) {
        for (int i = 0; i < CCM_COEF_NUM; i++) {
			ccm.ccm_coef[i] = 0;
		}
		
		ccm.ccm_coef[0] = 512;
		ccm.ccm_coef[4] = 512;
		ccm.ccm_coef[8] = 512;
		ISP_Set_CCM_Coef(&ccm);
		
        return -1;
    }

    imgproc_set_module_update(IMG_UPDATE_MASK_CCM);
    calc_ccm_by_color_temp(color_temp, &(isp_cfg.ccm));
    return 0;
}

static int calc_gamma_by_sys_gain(BL_GAIN_DB sys_gain, ISP_Gamma_Curve_Type *gamma)
{
    int i, value, gamma_idx, num_gamma;
    int ret = -1;
    BL_GAIN_DB sys_gain_L, sys_gain_H;
    const gamma_corr_t *gamma_L, *gamma_H;
    intpl_point_t point_L, point_H;

    num_gamma = img_param_get_num_gamma_corr();
    CHECK_PARAM(num_gamma >= 2);

    for (gamma_idx = 0; gamma_idx < (num_gamma - 1); gamma_idx++) {

        img_param_get_gamma_corr(gamma_idx, &gamma_L);
        img_param_get_gamma_corr(gamma_idx + 1, &gamma_H);

        sys_gain_L = INT_TO_GAIN_DB(gamma_L->sys_gain_db);
        sys_gain_H = INT_TO_GAIN_DB(gamma_H->sys_gain_db);

        if (sys_gain >= sys_gain_L && sys_gain <= sys_gain_H) {
            for (i = 0; i < GAMMA_COEF_NUM; i++) {
                /* interpolate each coef of gamma */
                point_L = create_intpl_point(sys_gain_L, gamma_L->gamma_curve.coef[i]);
                point_H = create_intpl_point(sys_gain_H, gamma_H->gamma_curve.coef[i]);
                linear_interpolate(&point_L, &point_H, sys_gain, &value);
                gamma->curve_coef[i] = value;
            }
            ret = 0;
            break;
        } else if (gamma_idx == 0 && sys_gain < sys_gain_L) {
            for (i = 0; i < GAMMA_COEF_NUM; i++) {
                gamma->curve_coef[i] = gamma_L->gamma_curve.coef[i];
            }
            ret = 0;
            break;
        } else if (gamma_idx == (num_gamma - 2) && sys_gain > sys_gain_H) {
            for (i = 0; i < GAMMA_COEF_NUM; i++) {
                gamma->curve_coef[i] = gamma_H->gamma_curve.coef[i];
            }
            ret = 0;
            break;
        }
    }

    return ret;
}

static int img_update_gamma(BL_GAIN_DB sys_gain)
{
    if (!imgproc_is_module_enable(ISP_ADJ_GAMMA)) {
        return -1;
    }

    imgproc_set_module_update(IMG_UPDATE_MASK_GAMMA);
    calc_gamma_by_sys_gain(sys_gain, &(isp_cfg.gamma));
    return 0;
}

static int calc_wdr_fw_config_by_sys_gain(BL_GAIN_DB sys_gain, wdr_fw_config_t *wdr_fw_config)
{
    int wdr_fw_config_idx;
    BL_GAIN_DB sys_gain_L, sys_gain_H;
    const wdr_fw_config_t *wdr_fw_config_L, *wdr_fw_config_H;
    intpl_point_t point_L, point_H;
    int num_wdr_fw_config = img_param_get_num_wdr_config();

    for (wdr_fw_config_idx = 0; wdr_fw_config_idx < (num_wdr_fw_config - 1); wdr_fw_config_idx++) {

        img_param_get_wdr_config(wdr_fw_config_idx, &wdr_fw_config_L);
        img_param_get_wdr_config(wdr_fw_config_idx + 1, &wdr_fw_config_H);

        sys_gain_L = INT_TO_GAIN_DB(wdr_fw_config_L->sys_gain_db);
        sys_gain_H = INT_TO_GAIN_DB(wdr_fw_config_H->sys_gain_db);

        if (sys_gain >= sys_gain_L && sys_gain <= sys_gain_H) {
            /* now we get the range of sys gain */

            // /* interpolate cs weight */
            point_L = create_intpl_point(sys_gain_L, wdr_fw_config_L->param.cs_weight);
            point_H = create_intpl_point(sys_gain_H, wdr_fw_config_H->param.cs_weight);
            linear_interpolate(&point_L, &point_H, sys_gain, (int *)&(wdr_fw_config->param.cs_weight));

            // /* interpolate cs gain_thresh */
            point_L = create_intpl_point(sys_gain_L, wdr_fw_config_L->param.cs_gain_thresh);
            point_H = create_intpl_point(sys_gain_H, wdr_fw_config_H->param.cs_gain_thresh);
            linear_interpolate(&point_L, &point_H, sys_gain, (int *)&(wdr_fw_config->param.cs_gain_thresh));

            /* interpolate curve_weight */
            point_L = create_intpl_point(sys_gain_L, wdr_fw_config_L->param.curve_weight);
            point_H = create_intpl_point(sys_gain_H, wdr_fw_config_H->param.curve_weight);
            linear_interpolate(&point_L, &point_H, sys_gain, (int *)&(wdr_fw_config->param.curve_weight));

            /* interpolate enh_weight */
            point_L = create_intpl_point(sys_gain_L, wdr_fw_config_L->param.enh_weight);
            point_H = create_intpl_point(sys_gain_H, wdr_fw_config_H->param.enh_weight);
            linear_interpolate(&point_L, &point_H, sys_gain, (int *)&(wdr_fw_config->param.enh_weight));

            /* interpolate enh_c_gain_extra_slope */
            point_L = create_intpl_point(sys_gain_L, wdr_fw_config_L->param.enh_c_gain_extra_slope);
            point_H = create_intpl_point(sys_gain_H, wdr_fw_config_H->param.enh_c_gain_extra_slope);
            linear_interpolate(&point_L, &point_H, sys_gain, (int *)&(wdr_fw_config->param.enh_c_gain_extra_slope));
            return 0;
        }

