bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_e907_std/BSP_Common/dvp/src/img_proc.c
        if (wdr_fw_config_idx == 0 && sys_gain < sys_gain_L) {
            *wdr_fw_config = *wdr_fw_config_L;
            return 0;
        }

        if (wdr_fw_config_idx == (num_wdr_fw_config - 2) && sys_gain > sys_gain_H) {
            *wdr_fw_config = *wdr_fw_config_H;
            return 0;
        }
    }

    /* should never reach here */
    return -1;
}

static int img_update_wdr(BL_GAIN_DB sys_gain)
{
    if (!imgproc_is_module_enable(ISP_ADJ_WDR)) {
        return -1;
    }

    wdr_fw_config_t wdr_fw_config;
    imgproc_set_module_update(IMG_UPDATE_MASK_WDR);
    calc_wdr_fw_config_by_sys_gain(sys_gain, &wdr_fw_config);
    wdr_control(&wdr_fw_config);

    return 0;
}

static int img_update_saturation(BL_GAIN_DB gain)
{
	ISP_SATURATION_S satCfg;
	
    if (!imgproc_is_module_enable(ISP_ADJ_SATURATION)) {
        satCfg.saturation_cb = 0;
		satCfg.saturation_cr = 0;
		ISP_Set_Saturation(&satCfg);
		
        return -1;
    }

    int param_idx;
    const saturation_t *saturation_L, *saturation_H;

    param_idx = gain / GAIN_6_DB;
    imgproc_set_module_update(IMG_UPDATE_MASK_SATURATION);

    img_param_get_saturation(param_idx, &saturation_L);
    img_param_get_saturation(param_idx + 1, &saturation_H);

    linear_intpl_by_gain(saturation_L->value, saturation_H->value, gain, &(isp_cfg.saturation));

//    MSG("saturation: (%d ~ %d) -> %d\r\n", saturation_L, saturation_H, saturation_new);

    return 0;
}

static int img_set_default_ee_luma_weight(void)
{
    int i;
    const ee_luma_wgt_t *lumaWgt;
    ISP_EE_Luma_Weight_Type lumaWgtCfg;

    img_param_get_default_EE_luma_weight(&lumaWgt);

    for (i = 0; i < ISP_EE_LUMA_WEIGHT_NUM; i ++) {
        lumaWgtCfg.lumaWgtTbl[i] = lumaWgt->lumaWgtTbl[i];
    }

    ISP_Set_EE_LumaWeight(&lumaWgtCfg);

    return 0;
}

static int img_update_ee(BL_GAIN_DB gain)
{
    if (!imgproc_is_module_enable(ISP_ADJ_EE)) {
        return -1;
    }

    int param_idx;
    const edge_enhance_t *edge_enhance_L, *edge_enhance_H;
    int value;

    param_idx = gain / GAIN_6_DB;
    imgproc_set_module_update(IMG_UPDATE_MASK_EE);

    img_param_get_edge_enhance(param_idx, &edge_enhance_L);
    img_param_get_edge_enhance(param_idx + 1, &edge_enhance_H);

    linear_intpl_by_gain(edge_enhance_L->posEdgeStr, edge_enhance_H->posEdgeStr, gain, &value);
    isp_cfg.ee_str.posEdgeStr = value;
    linear_intpl_by_gain(edge_enhance_L->negEdgeStr, edge_enhance_H->negEdgeStr, gain, &value);
    isp_cfg.ee_str.negEdgeStr = value;
    linear_intpl_by_gain(edge_enhance_L->posEdgeOvrshtStr, edge_enhance_H->posEdgeOvrshtStr, gain, &value);
    isp_cfg.ee_str.posEdgeOvrshtStr = value;
    linear_intpl_by_gain(edge_enhance_L->negEdgeOvrshtStr, edge_enhance_H->negEdgeOvrshtStr, gain, &value);
    isp_cfg.ee_str.negEdgeOvrshtStr = value;
    linear_intpl_by_gain(edge_enhance_L->nrStr, edge_enhance_H->nrStr, gain, &value);
    isp_cfg.ee_str.nrStr = value;
    linear_intpl_by_gain(edge_enhance_L->dirShpnessThresh, edge_enhance_H->dirShpnessThresh, gain, &value);
    isp_cfg.ee_th.dirShpnessThresh = value;
    linear_intpl_by_gain(edge_enhance_L->noDirShpnessThresh, edge_enhance_H->noDirShpnessThresh, gain, &value);
    isp_cfg.ee_th.noDirShpnessThresh = value;
    linear_intpl_by_gain(edge_enhance_L->flatThresh, edge_enhance_H->flatThresh, gain, &value);
    isp_cfg.ee_th.flatThresh = value;
    linear_intpl_by_gain(edge_enhance_L->textureThresh, edge_enhance_H->textureThresh, gain, &value);
    isp_cfg.ee_th.textureThresh = value;
    linear_intpl_by_gain(edge_enhance_L->edgeThresh, edge_enhance_H->edgeThresh, gain, &value);
    isp_cfg.ee_th.edgeThresh = value;
//    MSG("EE: noise_thresh (%d ~ %d) -> %d\r\n", edge_enhance_L->noise_thresh, edge_enhance_H->noise_thresh, noise_thresh);

    return 0;
}

static int img_update_nr(BL_GAIN_DB gain)
{
    if (!imgproc_is_module_enable(ISP_ADJ_NR)) {
        ISP_Set_Noise_Level(0);
        return -1;
    }

    int param_idx;
    const noise_reduction_t *noise_reduct_L, *noise_reduct_H;

    param_idx = gain / GAIN_6_DB;
    imgproc_set_module_update(IMG_UPDATE_MASK_NOISE_LEVEL);

    img_param_get_noise_reduction(param_idx, &noise_reduct_L);
    img_param_get_noise_reduction(param_idx + 1, &noise_reduct_H);

    linear_intpl_by_gain(noise_reduct_L->noise_level, noise_reduct_H->noise_level, gain, &(isp_cfg.noise_lv));
//    MSG("NR: noise_level (%d ~ %d) -> %d\r\n", noise_reduct_L->noise_level, noise_reduct_H->noise_level, noise_level);

    return 0;
}

static int img_update_cs(BL_GAIN_DB gain)
{
    if (!imgproc_is_module_enable(ISP_ADJ_CS)) {
        return -1;
    }

    int param_idx, value, divisor;
    const chroma_suppress_t *chroma_suppress_L, *chroma_suppress_H;

    param_idx = gain / GAIN_6_DB;
    imgproc_set_module_update(IMG_UPDATE_MASK_CS);

    img_param_get_chroma_suppress(param_idx, &chroma_suppress_L);
    img_param_get_chroma_suppress(param_idx + 1, &chroma_suppress_H);

    linear_intpl_by_gain(chroma_suppress_L->weight, chroma_suppress_H->weight, gain, &value);
    isp_cfg.cs.weight = value;
    linear_intpl_by_gain(chroma_suppress_L->gain_thresh, chroma_suppress_H->gain_thresh, gain, &value);
    isp_cfg.cs.gain_thresh = value;

    // ref to wdr
    divisor = (1 << (8 - 1)) - isp_cfg.cs.gain_thresh;
    isp_cfg.cs.gain = ((1 << (8 - 1)) * (1 << 8) + (divisor - 1)) / divisor;

    return 0;
}

static void imgproc_set_init_only_module()
{
    img_update_blc();
}

static int img_set_module_param(void)
{
    uint8_t nr_str;
    const bnr_fw_config_t *config;

    img_param_get_bnr_config(&config);
    bnr_config(config);

    img_param_get_default_2DNR_str(&nr_str);
    ISP_Set_2D_NR(nr_str);

    img_param_get_default_3DNR_str(&nr_str);
#if ENABLE_3DNR
    ISP_Set_3D_NR(nr_str);
#endif

    img_set_default_ee_luma_weight();

    return 0;
}

static bool imgproc_is_update_force()
{
    return ((0 != img_proc.update_force)? true: false);
}

static void imgproc_update_down()
{
    if (img_proc.update_force > 0) {
        img_proc.update_force--;
    }
}

// only for debug mode
int imgproc_update_force()
{
    img_proc.update_force = 3;
    return 0;
}

