bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_e907_std/BSP_Common/dvp/src/img_proc.c
static int imgproc_is_boot_frame()
{
    if (0 != img_proc.start_skip_num && img_proc.start_skip_num-- > 0) {
        return 1;
    }

    return 0;
}


static int imgproc_is_skip_frame(int *count)
{
    if ((*count)++ < img_proc.skip_num - 1) {
        return 1;
    }

    *count = 0;
    return 0;
}

static void imgproc_set_interrupt(BL_Fun_Type state)
{//Todo
    if (DISABLE == state) {
//        CPU_Interrupt_Disable(AE_STATS_IRQn);
//        CPU_Interrupt_Disable(AWB_STATS_IRQn);
//        CPU_Interrupt_Disable(AWB2_STATS_IRQn);
//        CPU_Interrupt_Disable(WDR_STATS_IRQn);
//
//        CPU_Interrupt_Disable(SEOF1_IRQn);
//        CPU_Interrupt_Disable(SEOF2_IRQn);
//        CPU_Interrupt_Disable(SEOF3_IRQn);
    }
    else {
//        CPU_Interrupt_Enable(AE_STATS_IRQn);
//            if (AWB_ALGO_1 == img_proc.awb_algo) {
//                CPU_Interrupt_Enable(AWB_STATS_IRQn);
//            }
//            else if (AWB_ALGO_2 == img_proc.awb_algo) {
//                CPU_Interrupt_Enable(AWB2_STATS_IRQn);
//            }
//            else {
//                MSG("AWB algo NOT Support!\r\n");
//            }
//        CPU_Interrupt_Enable(WDR_STATS_IRQn);
//
//        CPU_Interrupt_Enable(SEOF1_IRQn);
//        CPU_Interrupt_Enable(SEOF2_IRQn);
//        CPU_Interrupt_Enable(SEOF3_IRQn);
    }
}

void imgproc_dbg_set_awb_algo(AWB_ALGO algo)
{
    img_procawb_algo_new = algo;
}

int imgproc_init(void)
{
    int ret;

    memset(&img_proc, 0, sizeof(img_proc));
    memset(&isp_cfg, 0, sizeof(isp_cfg));

    ret = img_param_get_module(&(img_proc.img_param));
    if (-1 == ret) {
        MSG("improc: Get sensor param failed!\n");
    }

    ret = imgproc_check_param_table();
    if (-1 == ret) {
        MSG("improc: Please check module table!\n");
    }

    ret = imgproc_check_param_policy();
    if (-1 == ret) {
        MSG("improc: Please check module policy!\n");
    }

    img_proc.skip_num = IMG_PROC_SKIP_NUM;
    img_proc.start_skip_num  = IMG_START_SKIP_NUM;
    img_proc.awb_algo = img_procawb_algo_new;

    imgproc_set_interrupt(DISABLE);

    ae_init();
    awb_init(img_proc.awb_algo);
    wdr_init();
    bnr_init();
    //ir_board_config();
    //sensor_board_config();

    return 0;
}

int imgproc_bind_sensor_model(const char* sensor_name)
{
    return img_param_load(sensor_name);
}

int imgproc_set_config(img_proc_cfg_t *cfg, bool is_virtual_sensor)
{
    ae_config_t  ae_cfg;
    awb_config_t awb_cfg;
    wdr_config_t wdr_cfg;

    memcpy(&(ae_cfg.stats_cfg),  &(cfg->stats_cfg), sizeof(aaa_stats_cfg_t));
    memcpy(&(awb_cfg.stats_cfg), &(cfg->stats_cfg), sizeof(aaa_stats_cfg_t));
    memcpy(&(wdr_cfg.stats_cfg), &(cfg->stats_cfg), sizeof(aaa_stats_cfg_t));

    if (ae_config(&ae_cfg, is_virtual_sensor) < 0)
        return -1;

    if (awb_config(&awb_cfg, is_virtual_sensor) < 0)
        return -1;

    if (wdr_config(&wdr_cfg, is_virtual_sensor) < 0)
        return -1;

    img_set_module_param();

    return 0;
}

void vImageControlTask(void)
{
    int skip_cnt = img_proc.skip_num;

    ae_info_t  *ae_info;
    awb_info_t *awb_info;
    ae_get_info(&ae_info);
    awb_get_info(&awb_info);

    imgproc_update_force();
    imgproc_set_init_only_module();

    /* interrupts should be enabled after scheduler is started,
        otherwise deferring any work in ISR to Daemon task will assert */

    imgproc_set_interrupt(ENABLE);

    //while (!img_proc.stop_imgproc_flag) {

        if (imgproc_is_skip_frame(&skip_cnt)) {
            //continue;
        }

        img_update_ae();
        img_update_awb();

        if (imgproc_is_boot_frame()) {
            //continue;
        }

         if (ae_info->expo_time_update || imgproc_is_update_force()) {
             if (ae_info->ae_mode != AE_MODE_DBG_VIRTUAL) {
                 sensor_expo_time = ae_info->expo_time;
             }
         }
         if (ae_info->iso_update || imgproc_is_update_force()) {
             if (ae_info->ae_mode != AE_MODE_DBG_VIRTUAL) {
                 sensor_gain = ae_info->iso;
             }
         }

        if (ae_info->sys_gain_update || imgproc_is_update_force()) {
            img_update_wdr(ae_info->sys_gain);
            if (AWB_ALGO_1 == img_proc.awb_algo) {
                img_update_wb_bias(ae_info->sys_gain, &(awb_info->rb_bias));
            }
            img_update_gamma(ae_info->sys_gain);
        }

        if (ae_info->iso_update || imgproc_is_update_force()) {
            img_update_ae_target(ae_info->iso, &(ae_info->luma_target));
            img_update_dpc(ae_info->iso);
            img_update_bnr(ae_info->iso);
            img_update_cs(ae_info->iso);
            img_update_ee(ae_info->iso);
            img_update_nr(ae_info->iso);
            img_update_saturation(ae_info->iso);
        }

        if (awb_info->rb_gain_update || imgproc_is_update_force()) {
            if (AWB_ALGO_1 == img_proc.awb_algo) {
                img_update_wb_gain(&(awb_info->rb_gain), awb_info->color_temp, &(awb_info->rb_bias));
            }
        }

       if (awb_info->ct_update || imgproc_is_update_force()) {
           img_update_ccm(awb_info->color_temp);
           img_update_lsc(awb_info->color_temp);
       }

        imgproc_set_reg();

        imgproc_update_down();

        //imgproc_night_mode_enable(true);

#if PERFORMANCE_MONITOR
        do_frame_rate_stats("img handl", &ae_handl_cnt, FRM_CNT_FOR_ONE_STATS, &ae_handl_start_time);
#endif
    //}
}

void imgproc_night_mode_enable(bool enable)
{
    static bool pre_state;

    if (enable != pre_state) {
        ir_cut_switch(enable);
        day_night_mode = (enable ? BL_NIGHT_MODE : BL_DAY_MODE);
        pre_state = enable;
        MSG("night mode %d\r\n", enable);
    }
}

int imgproc_start(void)
{
    img_proc.stop_imgproc_flag = 0;
    vImageControlTask();

    return 0;
}

int imgproc_stop(void)
{
    img_proc.stop_imgproc_flag = 1;

    return 0;
}
